docs/assets/files/resources/resources_class.mmd
classDiagram
    Description <|-- Factory
    Entity <|-- Factory

    Entity <|-- Service
    Description <|-- Service
    Factory <|-- Service

    Entity <|-- ViewAssembler
    View <|-- ViewAssembler

    Entity <|.. View

    Service <|-- Controller
    View <|-- Controller
    ViewAssembler <|-- Controller
    Description <|-- Controller
